outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c009/bench_c52_20260831-011351.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30002 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 52 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c009/bench_c52_20260831-011351.jsonl --num-prompts 208
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30002, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=208, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=52, output_file='/workspace/outputs/c009/bench_c52_20260831-011351.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30002/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30002, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=208, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=52, output_file='/workspace/outputs/c009/bench_c52_20260831-011351.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 851968
#Output tokens: 212992
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 52        
Successful requests:                     208       
Benchmark duration (s):                  122.34    
Total input tokens:                      851968    
Total input text tokens:                 851968    
Total generated tokens:                  212992    
Total generated tokens (retokenized):    210282    
Request throughput (req/s):              1.70      
Input token throughput (tok/s):          6964.04   
Output token throughput (tok/s):         1741.01   
Peak output token throughput (tok/s):    2704.00   
Peak concurrent requests:                64        
Total token throughput (tok/s):          8705.05   
Concurrency:                             48.63     
Accept length:                           3.59      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   28601.42  
Median E2E Latency (ms):                 26817.17  
P90 E2E Latency (ms):                    35749.80  
P95 E2E Latency (ms):                    37366.79  
P99 E2E Latency (ms):                    49640.45  
---------------Time to First Token----------------
Mean TTFT (ms):                          3698.51   
Median TTFT (ms):                        2282.98   
P90 TTFT (ms):                           6844.60   
P95 TTFT (ms):                           8870.97   
P99 TTFT (ms):                           25592.70  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.34     
Median TPOT (ms):                        23.79     
P90 TPOT (ms):                           31.09     
P95 TPOT (ms):                           31.94     
P99 TPOT (ms):                           33.84     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           24.46     
Median ITL (ms):                         17.41     
P90 ITL (ms):                            50.95     
P95 ITL (ms):                            62.98     
P99 ITL (ms):                            103.64    
Max ITL (ms):                            6350.01   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/208 [00:00<?, ?it/s]
  0%|          | 1/208 [00:24<1:24:49, 24.59s/it]
  2%|▏         | 4/208 [00:24<16:10,  4.76s/it]  
  6%|▋         | 13/208 [00:25<03:35,  1.11s/it]
  8%|▊         | 16/208 [00:27<03:04,  1.04it/s]
 10%|█         | 21/208 [00:28<02:03,  1.52it/s]
 11%|█         | 23/208 [00:28<01:48,  1.70it/s]
 12%|█▏        | 24/208 [00:30<02:05,  1.47it/s]
 12%|█▏        | 25/208 [00:30<02:01,  1.50it/s]
 13%|█▎        | 27/208 [00:31<01:41,  1.79it/s]
 14%|█▍        | 29/208 [00:31<01:25,  2.09it/s]
 15%|█▍        | 31/208 [00:32<01:13,  2.42it/s]
 15%|█▌        | 32/208 [00:32<01:13,  2.41it/s]
 16%|█▋        | 34/208 [00:34<01:27,  1.99it/s]
 17%|█▋        | 35/208 [00:34<01:24,  2.05it/s]
 17%|█▋        | 36/208 [00:34<01:21,  2.10it/s]
 20%|█▉        | 41/208 [00:35<00:51,  3.25it/s]
 20%|██        | 42/208 [00:36<01:01,  2.70it/s]
 21%|██        | 44/208 [00:37<00:54,  2.99it/s]
 22%|██▏       | 46/208 [00:38<01:04,  2.52it/s]
 23%|██▎       | 47/208 [00:38<01:12,  2.22it/s]
 23%|██▎       | 48/208 [00:49<06:41,  2.51s/it]
 25%|██▌       | 52/208 [00:50<03:14,  1.25s/it]
 25%|██▌       | 53/208 [00:50<02:56,  1.14s/it]
 26%|██▋       | 55/208 [00:51<02:09,  1.19it/s]
 27%|██▋       | 57/208 [00:51<01:36,  1.56it/s]
 28%|██▊       | 59/208 [00:51<01:15,  1.99it/s]
 29%|██▉       | 60/208 [00:52<01:19,  1.86it/s]
 29%|██▉       | 61/208 [00:53<01:22,  1.78it/s]
 30%|██▉       | 62/208 [00:53<01:15,  1.94it/s]
 31%|███       | 64/208 [00:54<01:05,  2.20it/s]
 31%|███▏      | 65/208 [00:54<00:59,  2.40it/s]
 32%|███▏      | 66/208 [00:54<00:54,  2.58it/s]
 32%|███▏      | 67/208 [00:55<00:56,  2.52it/s]
 33%|███▎      | 69/208 [00:55<00:46,  2.97it/s]
 34%|███▍      | 71/208 [00:56<00:46,  2.96it/s]
 35%|███▍      | 72/208 [00:56<00:44,  3.08it/s]
 35%|███▌      | 73/208 [00:57<00:43,  3.11it/s]
 36%|███▌      | 75/208 [00:58<00:50,  2.65it/s]
 37%|███▋      | 76/208 [00:58<00:49,  2.66it/s]
 37%|███▋      | 77/208 [00:58<00:50,  2.58it/s]
 38%|███▊      | 78/208 [00:59<00:49,  2.64it/s]
 39%|███▉      | 81/208 [00:59<00:35,  3.54it/s]
 40%|███▉      | 83/208 [01:00<00:31,  3.95it/s]
 40%|████      | 84/208 [01:00<00:34,  3.55it/s]
 41%|████      | 85/208 [01:01<00:51,  2.39it/s]
 42%|████▏     | 87/208 [01:01<00:38,  3.18it/s]
 42%|████▏     | 88/208 [01:03<00:59,  2.02it/s]
 43%|████▎     | 89/208 [01:03<00:54,  2.17it/s]
 43%|████▎     | 90/208 [01:04<01:06,  1.78it/s]
 44%|████▍     | 91/208 [01:05<01:18,  1.49it/s]
 44%|████▍     | 92/208 [01:05<01:10,  1.66it/s]
 45%|████▍     | 93/208 [01:06<01:26,  1.34it/s]
 45%|████▌     | 94/208 [01:07<01:12,  1.58it/s]
 46%|████▌     | 95/208 [01:08<01:50,  1.02it/s]
 46%|████▌     | 96/208 [01:15<04:38,  2.48s/it]
 47%|████▋     | 97/208 [01:15<03:23,  1.83s/it]
 47%|████▋     | 98/208 [01:15<02:35,  1.42s/it]
 48%|████▊     | 99/208 [01:16<01:57,  1.08s/it]
 48%|████▊     | 100/208 [01:16<01:28,  1.22it/s]
 49%|████▉     | 102/208 [01:17<01:13,  1.44it/s]
 50%|████▉     | 103/208 [01:17<01:07,  1.55it/s]
 50%|█████     | 104/208 [01:18<00:57,  1.81it/s]
 50%|█████     | 105/208 [01:18<00:47,  2.17it/s]
 51%|█████     | 106/208 [01:18<00:42,  2.41it/s]
 51%|█████▏    | 107/208 [01:19<01:08,  1.47it/s]
 53%|█████▎    | 110/208 [01:20<00:36,  2.65it/s]
 53%|█████▎    | 111/208 [01:20<00:39,  2.47it/s]
 54%|█████▍    | 112/208 [01:21<00:53,  1.80it/s]
 55%|█████▍    | 114/208 [01:22<00:50,  1.86it/s]
 55%|█████▌    | 115/208 [01:23<00:44,  2.08it/s]
 56%|█████▌    | 116/208 [01:23<00:40,  2.28it/s]
 58%|█████▊    | 120/208 [01:23<00:21,  4.14it/s]
 58%|█████▊    | 121/208 [01:24<00:30,  2.82it/s]
 59%|█████▊    | 122/208 [01:25<00:30,  2.82it/s]
 60%|█████▉    | 124/208 [01:25<00:23,  3.57it/s]
 60%|██████    | 125/208 [01:26<00:27,  2.99it/s]
 61%|██████    | 126/208 [01:26<00:29,  2.80it/s]
 61%|██████    | 127/208 [01:26<00:27,  2.97it/s]
 62%|██████▏   | 128/208 [01:26<00:24,  3.28it/s]
 62%|██████▏   | 129/208 [01:27<00:25,  3.11it/s]
 63%|██████▎   | 131/208 [01:27<00:24,  3.09it/s]
 63%|██████▎   | 132/208 [01:28<00:26,  2.88it/s]
 64%|██████▍   | 134/208 [01:29<00:25,  2.94it/s]
 65%|██████▍   | 135/208 [01:30<00:37,  1.94it/s]
 65%|██████▌   | 136/208 [01:30<00:34,  2.10it/s]
 66%|██████▌   | 137/208 [01:31<00:49,  1.44it/s]
 66%|██████▋   | 138/208 [01:32<00:46,  1.51it/s]
 67%|██████▋   | 139/208 [01:33<00:55,  1.24it/s]
 67%|██████▋   | 140/208 [01:34<00:54,  1.26it/s]
 68%|██████▊   | 141/208 [01:36<01:18,  1.17s/it]
 69%|██████▉   | 143/208 [01:39<01:25,  1.32s/it]
 69%|██████▉   | 144/208 [01:40<01:20,  1.25s/it]
 70%|██████▉   | 145/208 [01:41<01:07,  1.07s/it]
 70%|███████   | 146/208 [01:41<00:53,  1.17it/s]
 71%|███████   | 147/208 [01:42<00:59,  1.02it/s]
 71%|███████   | 148/208 [01:42<00:46,  1.29it/s]
 72%|███████▏  | 149/208 [01:43<00:39,  1.51it/s]
 73%|███████▎  | 151/208 [01:44<00:38,  1.49it/s]
 74%|███████▎  | 153/208 [01:45<00:28,  1.94it/s]
 74%|███████▍  | 154/208 [01:45<00:29,  1.84it/s]
 75%|███████▍  | 155/208 [01:46<00:36,  1.46it/s]
 75%|███████▌  | 156/208 [01:47<00:31,  1.66it/s]
 75%|███████▌  | 157/208 [01:47<00:28,  1.81it/s]
 76%|███████▋  | 159/208 [01:48<00:18,  2.68it/s]
 77%|███████▋  | 161/208 [01:48<00:18,  2.59it/s]
 78%|███████▊  | 163/208 [01:49<00:15,  2.98it/s]
 79%|███████▉  | 165/208 [01:49<00:10,  4.07it/s]
 80%|████████  | 167/208 [01:49<00:08,  5.04it/s]
 81%|████████  | 168/208 [01:49<00:07,  5.06it/s]
 81%|████████▏ | 169/208 [01:50<00:08,  4.77it/s]
 82%|████████▏ | 170/208 [01:50<00:08,  4.27it/s]
 82%|████████▏ | 171/208 [01:50<00:08,  4.50it/s]
 83%|████████▎ | 173/208 [01:50<00:05,  5.94it/s]
 84%|████████▍ | 175/208 [01:50<00:04,  7.82it/s]
 85%|████████▌ | 177/208 [01:51<00:05,  5.48it/s]
 86%|████████▌ | 178/208 [01:51<00:05,  5.92it/s]
 86%|████████▌ | 179/208 [01:51<00:04,  5.98it/s]
 87%|████████▋ | 180/208 [01:52<00:07,  3.69it/s]
 88%|████████▊ | 182/208 [01:52<00:05,  5.18it/s]
 88%|████████▊ | 183/208 [01:52<00:06,  3.96it/s]
 88%|████████▊ | 184/208 [01:54<00:12,  1.92it/s]
 89%|████████▉ | 185/208 [01:54<00:11,  2.01it/s]
 90%|████████▉ | 187/208 [01:55<00:09,  2.11it/s]
 90%|█████████ | 188/208 [01:55<00:08,  2.33it/s]
 91%|█████████ | 189/208 [01:56<00:07,  2.43it/s]
 91%|█████████▏| 190/208 [01:56<00:06,  2.95it/s]
 92%|█████████▏| 191/208 [01:57<00:08,  1.98it/s]
 92%|█████████▏| 192/208 [01:59<00:14,  1.12it/s]
 93%|█████████▎| 193/208 [01:59<00:10,  1.48it/s]
 93%|█████████▎| 194/208 [01:59<00:07,  1.90it/s]
 94%|█████████▍| 195/208 [01:59<00:05,  2.23it/s]
 94%|█████████▍| 196/208 [01:59<00:04,  2.69it/s]
 96%|█████████▌| 199/208 [02:00<00:01,  4.68it/s]
 96%|█████████▌| 200/208 [02:00<00:01,  4.51it/s]
 97%|█████████▋| 201/208 [02:00<00:01,  4.10it/s]
 98%|█████████▊| 203/208 [02:01<00:00,  5.01it/s]
 99%|█████████▊| 205/208 [02:01<00:00,  6.45it/s]
 99%|█████████▉| 206/208 [02:01<00:00,  5.87it/s]
100%|█████████▉| 207/208 [02:01<00:00,  4.55it/s]
100%|██████████| 208/208 [02:02<00:00,  3.55it/s]
100%|██████████| 208/208 [02:02<00:00,  1.70it/s]